Revit 2024 API
FileImportingEventArgs.Path Property
 Path of the source file which is about to be imported.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2010
Syntax
C#
public string Path { get; }
Visual Basic
Public ReadOnly Property Path As String
	Get
Visual C++
public:
property String^ Path {
	String^ get ();
}
See Also
FileImportingEventArgs Class
Autodesk.Revit.DB.Events Namespace